<?php

namespace CdekSDK2\Actions;

class OfficesByPolygons extends Action
{
    use FilteredTrait;

    /**
     * URL для запросов к API
     * @var string
     */
    public const URL = '/deliverypoints/byPolygons';

    /**
     * Список корректных параметров, которые разрешено передавать для поиска офисов
     * @var array
     */
    public const FILTER = [
        // Широта верхней правой точки прямоугольника (в формате 6 знаков после запятой). Может принимать значения в диапазоне [-90, 90].
        'latitude_right_top' => '',
        // Долгота верхней правой точки прямоугольника (в формате 6 знаков после запятой). Может принимать значения в диапазоне [-180, 180].
        'longitude_right_top' => '',
        // Широта нижней левой точки прямоугольника (в формате 6 знаков после запятой). Может принимать значения в диапазоне [-90, 90].
        'latitude_left_bottom' => '',
        // Долгота нижней левой точки прямоугольника (в формате 6 знаков после запятой). Может принимать значения в диапазоне [-180, 180].
        'longitude_left_bottom' => '',
        // Тип офиса. Принимает значения "POSTAMAT", "PVZ", "ALL".
        'type' => '',
        // Идентификатор города в ИС СДЭК
        'city_uuid' => '',
        // Наличие терминала оплаты. Может принимать значения:
        'have_cashless' => '',
        // Есть прием наличных. Может принимать значения:
        'have_cash' => '',
        // Разрешен наложенный платеж. Может принимать значения:
        'allowed_cod' => '',
        // Наличие примерочной. Может принимать значения:
        'is_dressing_room' => '',
        // Максимальный вес в кг, который может принять офис (значения больше 0 - передаются офисы, которые принимают этот вес; 0 - офисы с нулевым весом не передаются; значение не указано - все офисы)
        'weight_max' => '',
        // Минимальный вес в кг, который принимает офис (при переданном значении будут выводиться офисы с минимальным весом до указанного значения)
        'weight_min' => '',
        // Локализация офиса.
        'lang' => '',
    ];
}
